using System;

namespace lab3
{
    //Система контроль за балансом абонента: якщо на рахунку достатньо коштів для оплати пакета послуг на місяць, то відповідна сума знімається з рахунку,
    //та надається пакет послуг який складається із певної кількості Мб та хвилин(наприклад за 145 грн надається 10240 Мб та 200 хв). Якщо коштів недостатньо
    //для оплати пакету послуг на місяць то при першому на добу використанні інтернету знімається відповідна сума і надається відповідний пакет(200 Мб за 7 грн),
    //а дзвінки тарифікуються по 0,60 грн/хв.Якщо коштів недостатньо для оплати то  дзвінки та користування інтернетом блокуються.Система повинна містити методи
    // використання інтернету(вказується кількість мегабайт) да здійснення дзвінка(як аргументи передається тривалість дзвінка та номер, в консоль виводиться залишоr на
    // рахунку після завершення дзвінка) Врахувати що при здійсненні дзвінка можуть закінчитись хвилини або кошти на рахунку і їх доведеться закінчити передчасно.











    public class Blocked : IState //if not enough money for anything
    {
        public void UseInter(Account account, int mbUsed)
        {
            Console.WriteLine("Account is blocked\n Internet access is unavailable");
        }

        public void MakeCall(Account account, int minutes, string number)
        {
            Console.WriteLine("Account is blocked\n Calls are unavailable");
        }
    }
}


