using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace lab3
{
    //Система контроль за балансом абонента: якщо на рахунку достатньо коштів для оплати пакета послуг на місяць, то відповідна сума знімається з рахунку,
    //та надається пакет послуг який складається із певної кількості Мб та хвилин(наприклад за 145 грн надається 10240 Мб та 200 хв). Якщо коштів недостатньо
    //для оплати пакету послуг на місяць то при першому на добу використанні інтернету знімається відповідна сума і надається відповідний пакет(200 Мб за 7 грн),
    //а дзвінки тарифікуються по 0,60 грн/хв.Якщо коштів недостатньо для оплати то  дзвінки та користування інтернетом блокуються.Система повинна містити методи
    // використання інтернету(вказується кількість мегабайт) да здійснення дзвінка(як аргументи передається тривалість дзвінка та номер, в консоль виводиться залишоr на
    // рахунку після завершення дзвінка) Врахувати що при здійсненні дзвінка можуть закінчитись хвилини або кошти на рахунку і їх доведеться закінчити передчасно.
    class Program
    {
        static void Main(string[] args)
        {
            Account account = new Account(150, 10240, 200);

            //use internet
            account.UseInter(500); // 500 mb

            //Make a call
            account.MakeCall(20, "0500654346"); // 20 min

            // if not enough for month
            account.SetState(new LowBalance());
            account.UseInter(50); //  50 mb (activate daily package)

            //if not enough on anything
            account.SetState(new Blocked());
            account.MakeCall(10, "0500654346"); // 10 min but blocked
            Console.ReadLine();
        }
    }
}


